## Dataframe

In [1]:
import numpy as np
import pandas as pd

*using lists*

In [3]:
data = [
    [1,2,3],
    [2,3,4]
]

pd.DataFrame(data,columns=['sno','a','b'])

   sno  a  b
0    1  2  3
1    2  3  4

*using dictionary*

In [12]:
dic = {
    'name':["A","B"],
    'roll_no':[1,2],
    'grade':['A','B']
}

stud = pd.DataFrame(dic)
stud

  name  roll_no grade
0    A        1     A
1    B        2     B

In [13]:
stud.set_index('roll_no',inplace=True)
stud

        name grade
roll_no
1          A     A
2          B     B

In [15]:
movies = pd.read_csv('movies.csv')
movies.sample()

,title_x,imdb_id,poster_path,wiki_link,title_y,original_title,is_adult,year_of_release,runtime,genres,imdb_rating,imdb_votes,story,summary,tagline,actors,wins_nominations,release_date
892,Break Ke Baad,tt1578261,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Break_Ke_Baad,Break Ke Baad,Break Ke Baad,0,2010,118,Comedy|Drama|Romance,5.2,3714,Mumbai-based Aaliya Khan and Abhay Gulati have...,Childhood friends Abhay and Aaliya experience ...,NaN,Deepika Padukone|Imran Khan|Lillete Dubey|Shar...,2 nominations,26 November 2010 (USA)

In [16]:
ipl = pd.read_csv('ipl-matches.csv')
ipl.sample()

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
40,1304080,Mumbai,2022-04-22,2022,34,Rajasthan Royals,Delhi Capitals,"Wankhede Stadium, Mumbai",Delhi Capitals,field,N,Rajasthan Royals,Runs,15.0,NaN,JC Buttler,"['JC Buttler', 'D Padikkal', 'SV Samson', 'SO ...","['PP Shaw', 'DA Warner', 'SN Khan', 'RR Pant',...",NA Patwardhan,Nitin Menon

### dataframe attributes and methods

In [17]:
movies.shape

(1629, 18)

In [19]:
stud.shape

(2, 2)

In [23]:
ipl.dtypes

ID                   int64
City                object
Date                object
Season              object
MatchNumber         object
Team1               object
Team2               object
Venue               object
TossWinner          object
TossDecision        object
SuperOver           object
WinningTeam         object
WonBy               object
Margin             float64
method              object
Player_of_Match     object
Team1Players        object
Team2Players        object
Umpire1             object
Umpire2             object
dtype: object

In [24]:
ipl.index

RangeIndex(start=0, stop=950, step=1)

In [25]:
movies.index

RangeIndex(start=0, stop=1629, step=1)

In [26]:
stud.index

Index([1, 2], dtype='int64', name='roll_no')

In [27]:
ipl.columns

Index(['ID', 'City', 'Date', 'Season', 'MatchNumber', 'Team1', 'Team2',
       'Venue', 'TossWinner', 'TossDecision', 'SuperOver', 'WinningTeam',
       'WonBy', 'Margin', 'method', 'Player_of_Match', 'Team1Players',
       'Team2Players', 'Umpire1', 'Umpire2'],
      dtype='object')

In [28]:
ipl.values

array([[1312200, 'Ahmedabad', '2022-05-29', ...,
        "['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pandya', 'DA Miller', 'R Tewatia', 'Rashid Khan', 'R Sai Kishore', 'LH Ferguson', 'Yash Dayal', 'Mohammed Shami']",
        'CB Gaffaney', 'Nitin Menon'],
       [1312199, 'Ahmedabad', '2022-05-27', ...,
        "['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D Padikkal', 'SO Hetmyer', 'R Parag', 'R Ashwin', 'TA Boult', 'YS Chahal', 'M Prasidh Krishna', 'OC McCoy']",
        'CB Gaffaney', 'Nitin Menon'],
       [1312198, 'Kolkata', '2022-05-25', ...,
        "['Q de Kock', 'KL Rahul', 'M Vohra', 'DJ Hooda', 'MP Stoinis', 'E Lewis', 'KH Pandya', 'PVD Chameera', 'Mohsin Khan', 'Avesh Khan', 'Ravi Bishnoi']",
        'J Madanagopal', 'MA Gough'],
       ...,
       [335984, 'Delhi', '2008-04-19', ...,
        "['T Kohli', 'YK Pathan', 'SR Watson', 'M Kaif', 'DS Lehmann', 'RA Jadeja', 'M Rawat', 'D Salunkhe', 'SK Warne', 'SK Trivedi', 'MM Patel']",
        'Aleem Dar', 'GA Pratapkumar'],
       [335983, 'Chandigarh', '2008-04-19', ...,
        "['PA Patel', 'ML Hayden', 'MEK Hussey', 'MS Dhoni', 'SK Raina', 'JDP Oram', 'S Badrinath', 'Joginder Sharma', 'P Amarnath', 'MS Gony', 'M Muralitharan']",
        'MR Benson', 'SL Shastri'],
       [335982, 'Bangalore', '2008-04-18', ...,
        "['SC Ganguly', 'BB McCullum', 'RT Ponting', 'DJ Hussey', 'Mohammad Hafeez', 'LR Shukla', 'WP Saha', 'AB Agarkar', 'AB Dinda', 'M Kartik', 'I Sharma']",
        'Asad Rauf', 'RE Koertzen']], dtype=object)

In [30]:
ipl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 950 entries, 0 to 949
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               950 non-null    int64
 1   City             899 non-null    object
 2   Date             950 non-null    object
 3   Season           950 non-null    object
 4   MatchNumber      950 non-null    object
 5   Team1            950 non-null    object
 6   Team2            950 non-null    object
 7   Venue            950 non-null    object
 8   TossWinner       950 non-null    object
 9   TossDecision     950 non-null    object
 10  SuperOver        946 non-null    object
 11  WinningTeam      946 non-null    object
 12  WonBy            950 non-null    object
 13  Margin           932 non-null    float64
 14  method           19 non-null     object
 15  Player_of_Match  946 non-null    object
 16  Team1Players     950 non-null    object
 17  Team2Players     950 non-null    object
 18  Umpire1          950 non-null    object
 19  Umpire2          950 non-null    object
dtypes: float64(1), int64(1), object(18)
memory usage: 148.6+ KB

In [31]:
ipl.describe()

                 ID      Margin
count  9.500000e+02  932.000000
mean   8.304852e+05   17.056867
std    3.375678e+05   21.633109
min    3.359820e+05    1.000000
25%    5.012612e+05    6.000000
50%    8.297380e+05    8.000000
75%    1.175372e+06   19.000000
max    1.312200e+06  146.000000

In [33]:
ipl.isnull().sum()

ID                   0
City                51
Date                 0
Season               0
MatchNumber          0
Team1                0
Team2                0
Venue                0
TossWinner           0
TossDecision         0
SuperOver            4
WinningTeam          4
WonBy                0
Margin              18
method             931
Player_of_Match      4
Team1Players         0
Team2Players         0
Umpire1              0
Umpire2              0
dtype: int64

In [35]:
ipl.duplicated().sum()

0

In [45]:
student_data = [
    ['I',100,80,10],
    ['II',90,70,7],
    ['III',120,100,14],
    ['IV',80,50,2]
]
stud = pd.DataFrame(student_data,columns=['sno','iq','marks','package'])
stud

   sno   iq  marks  package
0    I  100     80       10
1   II   90     70        7
2  III  120    100       14
3   IV   80     50        2

In [46]:
stud.rename(columns={'marks':'pct','package':'lpa'},inplace=True)

In [47]:
stud

   sno   iq  pct  lpa
0    I  100   80   10
1   II   90   70    7
2  III  120  100   14
3   IV   80   50    2

In [48]:
stud.sum()

sno    IIIIIIIV
iq          390
pct         300
lpa          33
dtype: object

In [49]:
stud.sum(axis=0)

sno    IIIIIIIV
iq          390
pct         300
lpa          33
dtype: object

In [53]:
stud.set_index('sno',inplace=True)

In [54]:
stud.sum(axis=1)

sno
I      190
II     167
III    234
IV     132
dtype: int64

In [134]:
ipl.mean(numeric_only=True)

ID         4.001053
Margin    17.056867
dtype: float64

In [57]:
stud.mean()

iq     97.50
pct    75.00
lpa     8.25
dtype: float64

In [61]:
stud['iq']

sno
I      100
II      90
III    120
IV      80
Name: iq, dtype: int64

In [62]:
stud[['iq','lpa']]

      iq  lpa
sno
I    100   10
II    90    7
III  120   14
IV    80    2

In [64]:
stud

      iq  pct  lpa
sno
I    100   80   10
II    90   70    7
III  120  100   14
IV    80   50    2

In [67]:
stud.iloc[2] # using index position

iq     120
pct    100
lpa     14
Name: III, dtype: int64

In [68]:
stud.iloc[[1,3]]

     iq  pct  lpa
sno
II   90   70    7
IV   80   50    2

In [69]:
stud.loc['I'] #using index label

iq     100
pct     80
lpa     10
Name: I, dtype: int64

In [70]:
stud.iloc[0:2,0:2]

      iq  pct
sno
I    100   80
II    90   70

In [74]:
stud.loc['I':"IV",'iq':'lpa']

      iq  pct  lpa
sno
I    100   80   10
II    90   70    7
III  120  100   14
IV    80   50    2

In [75]:
stud.loc[['I',"III"],['lpa','iq']]

     lpa   iq
sno
I     10  100
III   14  120

In [79]:
ipl[ipl['SuperOver']=='Y'].size

280

In [81]:
ipl[ipl['SuperOver']=='Y'].shape

(14, 20)

In [80]:
stud.size

12

In [82]:
movies['genres'].value_counts

<bound method IndexOpsMixin.value_counts of 0       Action|Drama|War
1                    War
2        Biography|Drama
3            Crime|Drama
4                  Drama
              ...
1624               Drama
1625               Drama
1626        Comedy|Drama
1627              Action
1628       Drama|Romance
Name: genres, Length: 1629, dtype: object>

In [84]:
movies[movies['genres'].str.contains('Action')].shape[0]

431

In [86]:
ipl.columns

Index(['ID', 'City', 'Date', 'Season', 'MatchNumber', 'Team1', 'Team2',
       'Venue', 'TossWinner', 'TossDecision', 'SuperOver', 'WinningTeam',
       'WonBy', 'Margin', 'method', 'Player_of_Match', 'Team1Players',
       'Team2Players', 'Umpire1', 'Umpire2'],
      dtype='object')

In [88]:
ipl['Team2'].value_counts()

Team2
Mumbai Indians                 119
Kolkata Knight Riders          118
Rajasthan Royals               103
Royal Challengers Bangalore    100
Kings XI Punjab                 98
Chennai Super Kings             97
Sunrisers Hyderabad             83
Delhi Daredevils                76
Deccan Chargers                 36
Delhi Capitals                  34
Pune Warriors                   23
Gujarat Lions                   14
Punjab Kings                    10
Gujarat Titans                   9
Rising Pune Supergiant           9
Rising Pune Supergiants          7
Lucknow Super Giants             7
Kochi Tuskers Kerala             7
Name: count, dtype: int64

In [117]:
def head_to_head(t1,t2):
    mask1 = ((ipl['Team1'] == t1) & (ipl['Team2']==t2)) | ((ipl['Team1']==t2) & (ipl['Team2']==t1))
    total_matches = ipl[mask1].shape[0]
    print(f"Total matches between {t1} and {t2} is {total_matches}")
    t1_win = ipl[mask1 & (ipl['WinningTeam'] == t1)]
    print(f"{t1} won {t1_win.shape[0]}")
    t2_win = ipl[mask1 & (ipl['WinningTeam'] == t2)]
    print(f"{t2} won {t2_win.shape[0]}")

In [118]:
head_to_head("Gujarat Titans","Lucknow Super Giants")

Total matches between Gujarat Titans and Lucknow Super Giants is 2
Gujarat Titans won 2
Lucknow Super Giants won 0

In [119]:
stud

      iq  pct  lpa
sno
I    100   80   10
II    90   70    7
III  120  100   14
IV    80   50    2

In [120]:
stud['clg'] = 'sece'

In [121]:
stud

      iq  pct  lpa   clg
sno
I    100   80   10  sece
II    90   70    7  sece
III  120  100   14  sece
IV    80   50    2  sece

In [122]:
movies.sample()

,title_x,imdb_id,poster_path,wiki_link,title_y,original_title,is_adult,year_of_release,runtime,genres,imdb_rating,imdb_votes,story,summary,tagline,actors,wins_nominations,release_date
274,Jai Gangaajal,tt4979082,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Jai_Gangaajal,Jai Gangaajal,Jai Gangaajal,0,2016,149,Crime|Drama,5.6,2308,A newly appointed Senior Inspector finds herse...,A newly appointed Senior Inspector finds herse...,NaN,Priyanka Chopra|Prakash Jha|Manav Kaul|Ninad K...,NaN,4 March 2016 (India)

In [124]:
movies.dropna(inplace=True)

In [125]:
movies['lead'] = movies['actors'].str.split('|').apply(lambda x: x[0])

In [127]:
type(movies['actors'].str.split('|'))

pandas.core.series.Series

In [129]:
movies['actors'].str.split('|').apply(lambda x:x[0])

11             Ranveer Singh
34              Gavie Chahal
37        Ayushmann Khurrana
87         Sidharth Malhotra
96                Ajay Devgn
                ...
1600             Divya Dutta
1601               Anant Nag
1607             Anil Kapoor
1621    Priyanshu Chatterjee
1623          Karisma Kapoor
Name: actors, Length: 298, dtype: object

In [130]:
ipl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 950 entries, 0 to 949
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               950 non-null    int64
 1   City             899 non-null    object
 2   Date             950 non-null    object
 3   Season           950 non-null    object
 4   MatchNumber      950 non-null    object
 5   Team1            950 non-null    object
 6   Team2            950 non-null    object
 7   Venue            950 non-null    object
 8   TossWinner       950 non-null    object
 9   TossDecision     950 non-null    object
 10  SuperOver        946 non-null    object
 11  WinningTeam      946 non-null    object
 12  WonBy            950 non-null    object
 13  Margin           932 non-null    float64
 14  method           19 non-null     object
 15  Player_of_Match  946 non-null    object
 16  Team1Players     950 non-null    object
 17  Team2Players     950 non-null    object
 18  Umpire1          950 non-null    object
 19  Umpire2          950 non-null    object
dtypes: float64(1), int64(1), object(18)
memory usage: 148.6+ KB

In [131]:
ipl["ID"] = ipl['ID'].astype('int8')